_________________________Hyper-parameters________________________
ENV_NAME: ConnectFour-v1
LR: 0.001
REPLAY_BUFFER_MAX_LENGTH: 100000
BATCH_SIZE: 32
EPS_START: 1
EPS_END: 0.01
EPS_DECAY_STEPS: 10000
GAMMA: 0.95
N_EPISODES: 10000
EPOCHS_PER_LEARNING: 2
EPOCHS_PER_PRETRAIN_LEARNING: 2
N_STEPS_PER_TARGET_UPDATE: 1000
PRETRAIN: True
PRETRAIN_UTILISATION_RATE: 0.95

__________________________Model Summary__________________________
Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
zero_padding2d_4 (ZeroPaddin (None, 7, 7, 1)           0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 6, 6, 64)          320       
_________________________________________________________________
activation_4 (Activation)    (None, 6, 6, 64)          0         
_________________________________________________________________
flatten_6 (Flatten)          (None, 2304)              0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 2304)              0         
_________________________________________________________________
dense_30 (Dense)             (None, 512)               1180160   
_________________________________________________________________
dense_31 (Dense)             (None, 256)               131328    
_________________________________________________________________
dense_32 (Dense)             (None, 128)               32896     
_________________________________________________________________
dense_33 (Dense)             (None, 64)                8256      
_________________________________________________________________
dense_34 (Dense)             (None, 7)                 455       
=================================================================
Total params: 1,353,415
Trainable params: 1,353,415
Non-trainable params: 0
_________________________________________________________________
