_________________________Hyper-parameters________________________
ENV_NAME: ConnectFour-v1
LR: 0.001
REPLAY_BUFFER_MAX_LENGTH: 100000
BATCH_SIZE: 32
EPS_START: 1
EPS_END: 0.01
EPS_DECAY_STEPS: 10000
GAMMA: 0.95
N_EPISODES: 15000
EPOCHS_PER_LEARNING: 2
EPOCHS_PER_PRETRAIN_LEARNING: 2
N_STEPS_PER_TARGET_UPDATE: 1000
PRETRAIN: True
PRETRAIN_UTILISATION_RATE: 0.95

__________________________Model Summary__________________________
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
zero_padding2d (ZeroPadding2 (None, 7, 7, 1)           0         
_________________________________________________________________
conv2d (Conv2D)              (None, 6, 6, 64)          320       
_________________________________________________________________
activation (Activation)      (None, 6, 6, 64)          0         
_________________________________________________________________
flatten (Flatten)            (None, 2304)              0         
_________________________________________________________________
dropout (Dropout)            (None, 2304)              0         
_________________________________________________________________
dense (Dense)                (None, 512)               1180160   
_________________________________________________________________
dense_1 (Dense)              (None, 512)               262656    
_________________________________________________________________
dense_2 (Dense)              (None, 512)               262656    
_________________________________________________________________
dense_3 (Dense)              (None, 512)               262656    
_________________________________________________________________
dense_4 (Dense)              (None, 7)                 3591      
=================================================================
Total params: 1,972,039
Trainable params: 1,972,039
Non-trainable params: 0
_________________________________________________________________
