_________________________Hyper-parameters________________________
ENV_NAME: ConnectFour-v1
LR: 0.001
REPLAY_BUFFER_MAX_LENGTH: 100000
BATCH_SIZE: 32
EPS_START: 1
EPS_END: 0.01
EPS_DECAY_STEPS: 10000
GAMMA: 0.95
N_EPISODES: 15000
EPOCHS_PER_LEARNING: 2
EPOCHS_PER_PRETRAIN_LEARNING: 2
N_STEPS_PER_TARGET_UPDATE: 1000
PRETRAIN: True
PRETRAIN_UTILISATION_RATE: 0.95

__________________________Model Summary__________________________
Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_2 (Flatten)          (None, 42)                0         
_________________________________________________________________
dense_10 (Dense)             (None, 84)                3612      
_________________________________________________________________
dense_11 (Dense)             (None, 84)                7140      
_________________________________________________________________
dense_12 (Dense)             (None, 84)                7140      
_________________________________________________________________
dense_13 (Dense)             (None, 84)                7140      
_________________________________________________________________
dense_14 (Dense)             (None, 7)                 595       
=================================================================
Total params: 25,627
Trainable params: 25,627
Non-trainable params: 0
_________________________________________________________________
